***NAME: SADDAM HUSSAIN***

***REG ID: GO_STP_6834***

---

1. Load the IMDb Dataset and read

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.read_csv('/content/IMDB-Movie-Data.csv')

2. View the dataset

In [ ]:
df

     Rank                    Title  ... Revenue (Millions) Metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]

In [ ]:
#Top 2 datas
df.head(2)

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0

[2 rows x 12 columns]

In [ ]:
#Bottom 2 datas
df.tail(2)

     Rank         Title  ... Revenue (Millions) Metascore
998   999  Search Party  ...                NaN      22.0
999  1000    Nine Lives  ...              19.64      11.0

[2 rows x 12 columns]

3. Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [ ]:
df.ndim

2

In [ ]:
#No of rows and columns
df.shape

(1000, 12)

In [ ]:
# Total no of data elements
df.size

12000

In [ ]:
# Get all the columns
df.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [ ]:
#rows index and column names
df.axes

[RangeIndex(start=0, stop=1000, step=1),
 Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
        'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
        'Metascore'],
       dtype='object')]

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.dtypes

Rank                    int64
Title                  object
Genre                  object
Description            object
Director               object
Actors                 object
Year                    int64
Runtime (Minutes)       int64
Rating                float64
Votes                   int64
Revenue (Millions)    float64
Metascore             float64
dtype: object

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [ ]:
df.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

4. Data Selection – Indexing and Slicing data

In [ ]:
# Rank (1st Column) Columns
df['Rank']

0         1
1         2
2         3
3         4
4         5
       ...
995     996
996     997
997     998
998     999
999    1000
Name: Rank, Length: 1000, dtype: int64

In [ ]:
# Rank,Title, Genre and Year Columns- Returns more than one columns
df[['Rank','Title','Genre','Year']]

     Rank                    Title                     Genre  Year
0       1  Guardians of the Galaxy   Action,Adventure,Sci-Fi  2014
1       2               Prometheus  Adventure,Mystery,Sci-Fi  2012
2       3                    Split           Horror,Thriller  2016
3       4                     Sing   Animation,Comedy,Family  2016
4       5            Suicide Squad  Action,Adventure,Fantasy  2016
..    ...                      ...                       ...   ...
995   996     Secret in Their Eyes       Crime,Drama,Mystery  2015
996   997          Hostel: Part II                    Horror  2007
997   998   Step Up 2: The Streets       Drama,Music,Romance  2008
998   999             Search Party          Adventure,Comedy  2014
999  1000               Nine Lives     Comedy,Family,Fantasy  2016

[1000 rows x 4 columns]

In [ ]:
df[10:12][['Rank','Title','Genre','Year']]

    Rank  ...  Year
10    11  ...  2016
11    12  ...  2016

[2 rows x 4 columns]

In [ ]:
# Get data from row 20 to 24
df[10:12]

    Rank  ... Metascore
10    11  ...      66.0
11    12  ...      74.0

[2 rows x 12 columns]

In [ ]:
#1st Row
df.iloc[0]

Rank                                                                  1
Title                                           Guardians of the Galaxy
Genre                                           Action,Adventure,Sci-Fi
Description           A group of intergalactic criminals are forced ...
Director                                                     James Gunn
Actors                Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...
Year                                                               2014
Runtime (Minutes)                                                   121
Rating                                                              8.1
Votes                                                            757074
Revenue (Millions)                                               333.13
Metascore                                                            76
Name: 0, dtype: object

In [ ]:
#  Two rows for all columns
df.iloc[10:12]

    Rank  ... Metascore
10    11  ...      66.0
11    12  ...      74.0

[2 rows x 12 columns]

In [ ]:
# Get only 0, 4, 7th columns for 10 to 13 data points
df.iloc[10:14,[0,4,7]]

    Rank        Director  Runtime (Minutes)
10    11     David Yates                133
11    12  Theodore Melfi                127
12    13  Gareth Edwards                133
13    14    Ron Clements                107

5. Data Selection – Based on Conditional filtering

In [ ]:
df[df['Rating']>8.5]

     Rank             Title  ... Revenue (Millions) Metascore
36     37      Interstellar  ...             187.99      74.0
54     55   The Dark Knight  ...             533.32      82.0
80     81         Inception  ...             292.57      74.0
96     97     Kimi no na wa  ...               4.68      79.0
117   118            Dangal  ...              11.15       NaN
249   250  The Intouchables  ...              13.18      57.0

[6 rows x 12 columns]

In [ ]:
df[df['Title'] == 'Mindhorn']

   Rank     Title   Genre  ... Votes Revenue (Millions) Metascore
7     8  Mindhorn  Comedy  ...  2490                NaN      71.0

[1 rows x 12 columns]

In [ ]:
df[(df['Year']==2012) & (df['Rating'] > 8)]

     Rank                  Title  ... Revenue (Millions) Metascore
76     77           The Avengers  ...             623.28      69.0
124   125  The Dark Knight Rises  ...             448.13      78.0
144   145       Django Unchained  ...             162.80      81.0
455   456                 Jagten  ...               0.61      76.0

[4 rows x 12 columns]

6. Groupby operations

In [ ]:
yeargroup = df.groupby('Year')

yeargroup.count()

      Rank  Title  Genre  ...  Votes  Revenue (Millions)  Metascore
Year                      ...
2006    44     44     44  ...     44                  42         41
2007    53     53     53  ...     53                  49         46
2008    52     52     52  ...     52                  51         49
2009    51     51     51  ...     51                  47         49
2010    60     60     60  ...     60                  57         59
2011    63     63     63  ...     63                  62         58
2012    64     64     64  ...     64                  64         62
2013    91     91     91  ...     91                  88         86
2014    98     98     98  ...     98                  94         95
2015   127    127    127  ...    127                 113        123
2016   297    297    297  ...    297                 205        268

[11 rows x 11 columns]

In [ ]:
yeargroup.mean()

            Rank  Runtime (Minutes)  ...  Revenue (Millions)  Metascore
Year                                 ...
2006  588.500000         120.840909  ...           86.296667  64.414634
2007  576.584906         121.622642  ...           87.882245  64.500000
2008  625.634615         110.826923  ...           99.082745  57.408163
2009  586.823529         116.117647  ...          112.601277  57.122449
2010  587.316667         111.133333  ...          105.081579  59.389831
2011  589.571429         114.603175  ...           87.612258  61.724138
2012  532.875000         119.109375  ...          107.973281  61.145161
2013  556.230769         116.065934  ...           87.121818  58.534884
2014  512.979592         114.489796  ...           85.078723  57.315789
2015  491.393701         114.496063  ...           78.355044  57.040650
2016  376.444444         107.373737  ...           54.690976  58.283582

[11 rows x 6 columns]

In [ ]:
a = yeargroup.max()
a.sort_values('Revenue (Millions)', ascending=False).head(2)

#Year 2015 was seen to have the highest revenue of 936.63 millions

      Rank       Title  ... Revenue (Millions) Metascore
Year                    ...
2015   996      Zipper  ...             936.63      95.0
2009   991  Zombieland  ...             760.51      88.0

[2 rows x 11 columns]

7. Sorting operation

In [ ]:
df_new = df.sort_values('Title')

In [ ]:
df_new.head()

     Rank                 Title  ... Revenue (Millions) Metascore
507   508  (500) Days of Summer  ...              32.39      76.0
118   119   10 Cloverfield Lane  ...              71.90      76.0
696   697              10 Years  ...               0.20       NaN
111   112      12 Years a Slave  ...              56.67      96.0
817   818             127 Hours  ...              18.33      82.0

[5 rows x 12 columns]

In [ ]:
df.sort_index(ascending=False).head(3)

     Rank                   Title  ... Revenue (Millions) Metascore
999  1000              Nine Lives  ...              19.64      11.0
998   999            Search Party  ...                NaN      22.0
997   998  Step Up 2: The Streets  ...              58.01      50.0

[3 rows x 12 columns]

In [ ]:
df.sort_values(by = ['Rating','Year'], ascending=[False, True]).head(2)
# The Highest rating of was in year 2008

    Rank            Title  ... Revenue (Millions) Metascore
54    55  The Dark Knight  ...             533.32      82.0
80    81        Inception  ...             292.57      74.0

[2 rows x 12 columns]

8. Dealing with missing values

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [ ]:
df.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [ ]:
df['Revenue (Millions)'].isnull().any()

True

In [ ]:
df['Revenue (Millions)'].median()

47.985

In [ ]:
# To get the Median value
#df['Revenue (Millions)'].median()

# inplace = True when we want to update the same data
df['Revenue (Millions)'].fillna(df['Revenue (Millions)'].median(), inplace = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  1000 non-null   float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

9. Dropping columns and null values

In [ ]:
# Metascore has less no of data as null so we can drop them
df.dropna(inplace= True)

In [ ]:
df.isnull().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 936 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                936 non-null    int64
 1   Title               936 non-null    object
 2   Genre               936 non-null    object
 3   Description         936 non-null    object
 4   Director            936 non-null    object
 5   Actors              936 non-null    object
 6   Year                936 non-null    int64
 7   Runtime (Minutes)   936 non-null    int64
 8   Rating              936 non-null    float64
 9   Votes               936 non-null    int64
 10  Revenue (Millions)  936 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 95.1+ KB

In [ ]:
#df.dele('Rank', inplace = True)
#df.drop(columns=['Rank'], inplace = True)

#OR
del df['Rank']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 936 entries, 0 to 999
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Title               936 non-null    object
 1   Genre               936 non-null    object
 2   Description         936 non-null    object
 3   Director            936 non-null    object
 4   Actors              936 non-null    object
 5   Year                936 non-null    int64
 6   Runtime (Minutes)   936 non-null    int64
 7   Rating              936 non-null    float64
 8   Votes               936 non-null    int64
 9   Revenue (Millions)  936 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 87.8+ KB

10. Apply( ) functions

In [ ]:
def hrs(runtime):
  hr = runtime/60
  hr = hr.round(2)
  return hr

In [ ]:
# Converted Minutes to hours
df[['Runtime (Minutes)']].apply(hrs)

     Runtime (Minutes)
0                 2.02
1                 2.07
2                 1.95
3                 1.80
4                 2.05
..                 ...
995               1.85
996               1.57
997               1.63
998               1.55
999               1.45

[936 rows x 1 columns]